HELYXcore-4.4.0/modules/swak4Foam/Examples/FvOptions/angleDuctWithSources/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    "(rho|U|h|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(rho|U|h|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }
    "poroTime.*"
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

PIMPLE
{
    momentumPredictor yes;
    consistent        yes;
    transonic       no;
    nOuterCorrectors 50;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.4;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 4;

    residualControl
    {
        "(U|k|epsilon)"
        {
            relTol          0;
            tolerance       0.0001;
        }
    }

    turbOnFinalIterOnly on;
}

"poroTime.*TransportPDE"
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    fields
    {
        // "p.*"           0.3;
        // "rho.*"         0.01;
        "p.*"           0.9;
        "rho.*"         1;
    }
    equations
    {
        // "(U|h|k|epsilon|omega).*" 0.7;
        "U.*"           0.9;
        "h.*"           0.7;
        "(k|epsilon|omega).*" 0.8;
    }
}


// ************************************************************************* //
